<template>
    <div class="container">
        <div v-if="beforeSend">
            <div class="content"
                 @scroll="$event.target.scrollHeight - $event.target.scrollTop === $event.target.offsetHeight ? show = true : '' ">
                Биржа копирайтинга Как заказать текст на бирже копирайтинга
                Биржа рерайтинга
                Магазин статей
                Магазин новостей
                Уникальность текста
                Проверка орфографии
                SEO анализ
                Синонимы к слову
                Уникальность сайта
                Уникальность документа
                Регулярная проверка
                API уникальности
                Пакеты символов
                SEO-копирайтинг от лучших авторов, работа копирайтером на дому
                ОНЛАЙН-СЕРВИС ПРОВЕРКИ ТЕКСТА НА УНИКАЛЬНОСТЬ
                Вставьте текст...
                Всего символов: 0 Без пробелов: 0 Количество слов: 0

                Сервис онлайн проверки текста на уникальность Text.ru покажет процент уникальности текста. Глубокая и
                качественная проверка найдет дубликаты и рерайт.Бесплатное определение уникальности текстов.

                Эффективные алгоритмы позволили сделать проверку глубокой и точной. Автоматическая проверка орфографии
                подскажет, где были допущены ошибки.Расширенные возможности. При регистрации на сервисе у вас будут
                расширены ограничения проверки, предназначенные для гостей, и вы получите возможность проверять гораздо
                большее количество текстов с помощью нашего сервиса плагиат онлайн.
                БИРЖА КОПИРАЙТИНГА И РЕРАЙТИНГА
                На бирже копирайтинга+211
                13
                alex.z.awg

                Бизнесмен
                Нужна статья на тему Video production по примеру статьи ниже!Video productionСрок: ~ день 600,00 руб.
                41
                NNmedia

                Миллионер
                Написать тексты на тему АвзозапчастиСрок: ~ 5 дней 500,00 руб.
                13
                yulya80

                Бизнесмен
                Копирайтер на проектную работуСрок: ~ 3 дня 400,00 руб.
                2
                На перспективу

                Мелкий заказчик
                Рецензия на статью о школеСрок: ~ 3 дня 350,00 руб.
                2
                На перспективу

                Мелкий заказчик
                Рецензия на статью о борьбе с бедностьюСрок: ~ 3 дня 350,00 руб.
                24
                SEODEV.by

                Крупный бизнесмен
                8 небольших текстов для коммерческого сайта. Крепление для щитов. Лампы светодиодныеСрок: ~ 18 часов 320,00
                руб.
                На бирже рерайтинга+277
                56
                sharapov56

                Олигарх
                рулет из лаваша с крабовыми палочкамиСрок: ~ 6 дней 700,00 руб.
                56
                sharapov56

                Олигарх
                фаршированные крабовые палочкиСрок: ~ 6 дней 500,00 руб.
                10
                usoft

                Предприниматель
                Инструкция по использованию личного кабинета МосОблЕИРЦСрок: ~ 2 дня 450,00 руб.
                56
                sharapov56

                Олигарх
                тарталетки с крабовыми палочкамиСрок: ~ 6 дней 350,00 руб.
                4
                evkara777

                Постоянный заказчик
                Создать тему о блокчейн-проекте на тематическом ангдоязычном форумеСрок: ~ 5 дней 350,00 руб.
                13
                Aleksey1206

                Бизнесмен
                Необходимо написать статью на тему: Телеграм для ЛинуксСрок: ~ 17 часов 350,00 руб.
                Информация
                Биржа копирайтинга Text.ru — это достойный заработок для копирайтеров и возможность заказать текст у
                профессиональных авторов. Здесь вы можете реализовать свой творческий потенциал или приобрести уникальные
                статьи для нужд своего сайта.Рейтинг копирайтеров наглядно демонстрирует опыт и востребованность исполнителя
                на сервисе Text.ru и позволяет заказчику быстро выбрать исполнителя на свой заказ.
                Простота в работе. Мы приложили много усилий, чтобы работать на нашей бирже копирайтинга было максимально
                легко и удобно. Интуитивно понятный интерфейс, постоянное совершенствование функционала и подробный FAQ
                помогут в работе начинающим и обеспечат комфорт постоянным пользователям сервиса Text.ru.
            </div>
            <div v-if="show">
                <div class="checkbox-group">
                    <label>I agree this text</label>
                    <input type="checkbox" v-model="checkboxsStatus.agree"/>
                </div>
                <div class="checkbox-group">
                    <label>Send me spam</label>
                    <input type="checkbox" v-model="checkboxsStatus.send"/>
                </div>
                <div v-if="checkboxsStatus.send">
                    <div class="radio-button-group">
                        <label>Send me spam on email</label>
                        <input type="radio" id="email" value="email" v-model="radioButton">
                    </div>
                    <div class="radio-button-group">
                        <label>Send me spam on phone</label>
                        <input type="radio" id="phone" value="phone" v-model="radioButton">
                    </div>
                </div>
                <button v-if="checkboxsStatus.agree"  @click="beforeSend = !beforeSend">go</button>
            </div>
        </div>
        <div v-else>
            <table>
                <tr v-for="(value, key) in checkboxsStatus">
                    <th>{{key}}</th>
                    <th>{{value}}</th>
                </tr>
                <tr v-if="checkboxsStatus.send">
                    <th> send me span on {{radioButton}}</th>
                </tr>
            </table>
        </div>
    </div>
</template>

<script>
    export default {
        name: "CheckboxForm",
        data: () => {
            return {
                show: false,
                beforeSend: true,
                checkboxsStatus: {
                    agree: false,
                    send: false
                },
                radioButton: 'email'
            }
        },
        methods: {}
    }

</script>

<style lang="scss">
    .content {
        grid-column: 2/span 1;
        height: 600px;
        overflow: auto;
        .checkbox-group {

        }
    }
</style>